ir_version: 7
producer_name: "pytorch"
producer_version: "1.12.0"
graph {
  node {
    input: "image"
    output: "onnx::Reshape_5"
    name: "MaxPool_0"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 0
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    doc_string: "/usr/local/lib/python3.8/dist-packages/torch/nn/functional.py(782): _max_pool2d\n/usr/local/lib/python3.8/dist-packages/torch/_jit_internal.py(423): fn\n./gen_mnist_onnx.py(24): forward\n/usr/local/lib/python3.8/dist-packages/torch/nn/modules/module.py(1118): _slow_forward\n/usr/local/lib/python3.8/dist-packages/torch/nn/modules/module.py(1130): _call_impl\n/usr/local/lib/python3.8/dist-packages/torch/jit/_trace.py(118): wrapper\n/usr/local/lib/python3.8/dist-packages/torch/jit/_trace.py(127): forward\n/usr/local/lib/python3.8/dist-packages/torch/nn/modules/module.py(1130): _call_impl\n/usr/local/lib/python3.8/dist-packages/torch/jit/_trace.py(1175): _get_trace_graph\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(517): _trace_and_get_graph_from_model\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(602): _create_jit_graph\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(727): _model_to_graph\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(1074): _export\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(163): export\n/usr/local/lib/python3.8/dist-packages/torch/onnx/__init__.py(350): export\n./gen_mnist_onnx.py(186): main\n./gen_mnist_onnx.py(195): <module>\n"
  }
  node {
    output: "onnx::Reshape_6"
    name: "Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377\304\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
    doc_string: "./gen_mnist_onnx.py(25): forward\n/usr/local/lib/python3.8/dist-packages/torch/nn/modules/module.py(1118): _slow_forward\n/usr/local/lib/python3.8/dist-packages/torch/nn/modules/module.py(1130): _call_impl\n/usr/local/lib/python3.8/dist-packages/torch/jit/_trace.py(118): wrapper\n/usr/local/lib/python3.8/dist-packages/torch/jit/_trace.py(127): forward\n/usr/local/lib/python3.8/dist-packages/torch/nn/modules/module.py(1130): _call_impl\n/usr/local/lib/python3.8/dist-packages/torch/jit/_trace.py(1175): _get_trace_graph\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(517): _trace_and_get_graph_from_model\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(602): _create_jit_graph\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(727): _model_to_graph\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(1074): _export\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(163): export\n/usr/local/lib/python3.8/dist-packages/torch/onnx/__init__.py(350): export\n./gen_mnist_onnx.py(186): main\n./gen_mnist_onnx.py(195): <module>\n"
  }
  node {
    input: "onnx::Reshape_5"
    input: "onnx::Reshape_6"
    output: "onnx::Gemm_7"
    name: "Reshape_2"
    op_type: "Reshape"
    doc_string: "./gen_mnist_onnx.py(25): forward\n/usr/local/lib/python3.8/dist-packages/torch/nn/modules/module.py(1118): _slow_forward\n/usr/local/lib/python3.8/dist-packages/torch/nn/modules/module.py(1130): _call_impl\n/usr/local/lib/python3.8/dist-packages/torch/jit/_trace.py(118): wrapper\n/usr/local/lib/python3.8/dist-packages/torch/jit/_trace.py(127): forward\n/usr/local/lib/python3.8/dist-packages/torch/nn/modules/module.py(1130): _call_impl\n/usr/local/lib/python3.8/dist-packages/torch/jit/_trace.py(1175): _get_trace_graph\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(517): _trace_and_get_graph_from_model\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(602): _create_jit_graph\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(727): _model_to_graph\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(1074): _export\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(163): export\n/usr/local/lib/python3.8/dist-packages/torch/onnx/__init__.py(350): export\n./gen_mnist_onnx.py(186): main\n./gen_mnist_onnx.py(195): <module>\n"
  }
  node {
    input: "onnx::Gemm_7"
    input: "fc1.weight"
    input: "fc1.bias"
    output: "x"
    name: "Gemm_3"
    op_type: "Gemm"
    attribute {
      name: "alpha"
      f: 1.0
      type: FLOAT
    }
    attribute {
      name: "beta"
      f: 1.0
      type: FLOAT
    }
    attribute {
      name: "transB"
      i: 1
      type: INT
    }
    doc_string: "/usr/local/lib/python3.8/dist-packages/torch/nn/modules/linear.py(114): forward\n/usr/local/lib/python3.8/dist-packages/torch/nn/modules/module.py(1118): _slow_forward\n/usr/local/lib/python3.8/dist-packages/torch/nn/modules/module.py(1130): _call_impl\n./gen_mnist_onnx.py(26): forward\n/usr/local/lib/python3.8/dist-packages/torch/nn/modules/module.py(1118): _slow_forward\n/usr/local/lib/python3.8/dist-packages/torch/nn/modules/module.py(1130): _call_impl\n/usr/local/lib/python3.8/dist-packages/torch/jit/_trace.py(118): wrapper\n/usr/local/lib/python3.8/dist-packages/torch/jit/_trace.py(127): forward\n/usr/local/lib/python3.8/dist-packages/torch/nn/modules/module.py(1130): _call_impl\n/usr/local/lib/python3.8/dist-packages/torch/jit/_trace.py(1175): _get_trace_graph\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(517): _trace_and_get_graph_from_model\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(602): _create_jit_graph\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(727): _model_to_graph\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(1074): _export\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(163): export\n/usr/local/lib/python3.8/dist-packages/torch/onnx/__init__.py(350): export\n./gen_mnist_onnx.py(186): main\n./gen_mnist_onnx.py(195): <module>\n"
  }
  node {
    input: "x"
    output: "onnx::Gemm_9"
    name: "Relu_4"
    op_type: "Relu"
    doc_string: "/usr/local/lib/python3.8/dist-packages/torch/nn/functional.py(1457): relu\n./gen_mnist_onnx.py(27): forward\n/usr/local/lib/python3.8/dist-packages/torch/nn/modules/module.py(1118): _slow_forward\n/usr/local/lib/python3.8/dist-packages/torch/nn/modules/module.py(1130): _call_impl\n/usr/local/lib/python3.8/dist-packages/torch/jit/_trace.py(118): wrapper\n/usr/local/lib/python3.8/dist-packages/torch/jit/_trace.py(127): forward\n/usr/local/lib/python3.8/dist-packages/torch/nn/modules/module.py(1130): _call_impl\n/usr/local/lib/python3.8/dist-packages/torch/jit/_trace.py(1175): _get_trace_graph\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(517): _trace_and_get_graph_from_model\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(602): _create_jit_graph\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(727): _model_to_graph\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(1074): _export\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(163): export\n/usr/local/lib/python3.8/dist-packages/torch/onnx/__init__.py(350): export\n./gen_mnist_onnx.py(186): main\n./gen_mnist_onnx.py(195): <module>\n"
  }
  node {
    input: "onnx::Gemm_9"
    input: "fc2.weight"
    input: "fc2.bias"
    output: "x.3"
    name: "Gemm_5"
    op_type: "Gemm"
    attribute {
      name: "alpha"
      f: 1.0
      type: FLOAT
    }
    attribute {
      name: "beta"
      f: 1.0
      type: FLOAT
    }
    attribute {
      name: "transB"
      i: 1
      type: INT
    }
    doc_string: "/usr/local/lib/python3.8/dist-packages/torch/nn/modules/linear.py(114): forward\n/usr/local/lib/python3.8/dist-packages/torch/nn/modules/module.py(1118): _slow_forward\n/usr/local/lib/python3.8/dist-packages/torch/nn/modules/module.py(1130): _call_impl\n./gen_mnist_onnx.py(28): forward\n/usr/local/lib/python3.8/dist-packages/torch/nn/modules/module.py(1118): _slow_forward\n/usr/local/lib/python3.8/dist-packages/torch/nn/modules/module.py(1130): _call_impl\n/usr/local/lib/python3.8/dist-packages/torch/jit/_trace.py(118): wrapper\n/usr/local/lib/python3.8/dist-packages/torch/jit/_trace.py(127): forward\n/usr/local/lib/python3.8/dist-packages/torch/nn/modules/module.py(1130): _call_impl\n/usr/local/lib/python3.8/dist-packages/torch/jit/_trace.py(1175): _get_trace_graph\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(517): _trace_and_get_graph_from_model\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(602): _create_jit_graph\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(727): _model_to_graph\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(1074): _export\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(163): export\n/usr/local/lib/python3.8/dist-packages/torch/onnx/__init__.py(350): export\n./gen_mnist_onnx.py(186): main\n./gen_mnist_onnx.py(195): <module>\n"
  }
  node {
    input: "x.3"
    output: "prediction"
    name: "Softmax_6"
    op_type: "Softmax"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
    doc_string: "/usr/local/lib/python3.8/dist-packages/torch/nn/functional.py(1834): softmax\n./gen_mnist_onnx.py(29): forward\n/usr/local/lib/python3.8/dist-packages/torch/nn/modules/module.py(1118): _slow_forward\n/usr/local/lib/python3.8/dist-packages/torch/nn/modules/module.py(1130): _call_impl\n/usr/local/lib/python3.8/dist-packages/torch/jit/_trace.py(118): wrapper\n/usr/local/lib/python3.8/dist-packages/torch/jit/_trace.py(127): forward\n/usr/local/lib/python3.8/dist-packages/torch/nn/modules/module.py(1130): _call_impl\n/usr/local/lib/python3.8/dist-packages/torch/jit/_trace.py(1175): _get_trace_graph\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(517): _trace_and_get_graph_from_model\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(602): _create_jit_graph\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(727): _model_to_graph\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(1074): _export\n/usr/local/lib/python3.8/dist-packages/torch/onnx/utils.py(163): export\n/usr/local/lib/python3.8/dist-packages/torch/onnx/__init__.py(350): export\n./gen_mnist_onnx.py(186): main\n./gen_mnist_onnx.py(195): <module>\n"
  }
  name: "torch_jit"
  initializer {
    dims: 128
    dims: 196
    data_type: 1
    name: "fc1.weight"
    raw_data: "Mt\004=}n\023\275\271\t\226\274\333\354\353<C>\223\275K\"\035=\225{\233\274\356\314\002=<v\274;\0222M\274d\030\202<\3500\202\272\335\035\261<\363O\004\275\006\203\036\274\220\2610\274\'\n\303;1\333\006\274<QR=C\n\264;\255lg\275\256\221\217\275p\254\033\275\1771-\275, \345\274B\352\321\273?\234\006=\331\252\014=x&\230\275\260i\037==\214h<?\3376=\202\364*=1\260\027\275\374\221<\275f\201\007\275g\331\242=\311ho\274\225E5=\365^z<\032\324\262=\310\017\005\275\265\377G=\243 \364\272\372\035#\275%\021\206=\020t\310\273z;\323;\024\\\274\275\223\372\006\276\226\343\372\275\276\331\027\275$\266S=\266\243\312=\260\025,>\220\311\204=,a\370\273\205\335-\275rlJ=\207\270\240=<\021\264\273\266\360\231=\t\273\025\274\253\323\214\275\336-\201\275+\221\001=\242d\031=>\307\001>\3143\274=\312m\t\275\0074\022=\327\367\017\274_eH=Hd\216=y\032\006>\216\262!>s\261L>\275\204t=\3544}\274\332\247\262<W\262\265\275\347\212\033\275\277\314p=\301r\311\273,G\035=\000\245%\275\027\344\030\275\006\261\006>M\264\234=m\3367>k\261\352=\\\310\230\275\177\357\017=Z\007\264\274\007Q\347\275\331\321\036\275\036Z\323<\260x\026<2\317\r\275\353\317\320\274\230%H=\020\261\202\274\035\231C=\204K\336<]R\377\275W}\347\275\'\353\360<4-?<\2114\321=\260\366\226=\352I\235<\215\200\'=\224%\201=\005\224m\275m0\372\274\204v\313;\372\315~;\306,\035\274\355\354\322\275\022 \014\276\242\227\244\275oui=\220\340\023>\376\004\211\274X\322\217;a\351f\275\006m\222\275\217\226\367\274\224A?<\255m\232=\330\231\347\274\306\031:=\336\ra=+\231\002\275\260\231\233;=\241\216=Y\230\'=O\257\004\274\026\312\304\275d\007\216\275\177C\030\275\023\373\007\275a\277\267\275Z\201\226;\273r\252<\233g\030=\262\027\202=\214T\034\274\244&T=mz2=\326^=\275L\022\030=\330Y\024\275\002\243\t\274\312>\223\275\016F\201\275\034\001\310\275,\231\310\275 \201\315:q[\003<\357gf=\341\341\030>\204\202\340=\324\272\231=n8&\275v_Y\274-\3267\275\304\021\252\274\331s{\275cp\030\275\262\301\021\275\344;\212<\003\321\243<\3060\010=N\202\360=\330p!>\337\207\331=\353\265\206;WH|\275x\336\025=\2369\324\274\306\314\'\274j,\207\275/-\230\274\323TS\275?\255\203=(\210y\275\002\327m\275\367\315\255\274\234Y6\275\034\006\206<\332\220I\275\232X;\275\0020\3559VpA=?\031`\275\300b\323<iB\034=\350}~=\342zl\275\201C\033<\370\221z\275\312\335T=\245\215\020\275\314\207\020=b\375\267\273\031\363Y\274\277$$\274\250G\220;\336n\324<k\215s;L\327h<\365\005\223\275\365\3234=4_H=\310&\034=\022\264/=?\365R\275\"\3311\275S\350\002=2=\240\275\266\367c=\006\226\202\275\263\276m\275\226\251\336<\3637l\275{\005\225\274\031\201\031=Y\250O<L\005\264<_\362\002\275\372E\305\275x\336U\274\331M\277\275\347~\223\275\236\230\025\275\224\275\240\275\335\302$=\025s\030=\373li\275\306\3377\275\3401\320\272\267\370\304<:p\006=\306/\014=\267\"\332=C\267\001=\220\211\235\274\335T%\275\2656#\273\211\317\302<\327\274\t\275~\321\177\273\202\331V=T\\P=\024\354\324\273\224\375\243=\337T\336=yM\n>&\243$>\336\313B>\367y\342=\362o\001;J\r\213=l\233F:\330\216Y\275\2555\014=E\013\346\274\261\n\332=\\\3451\273\322#\253=a\226\030=\036\253\016>\t\006\206>Ol\033=\245^\003={k\207<\035A\'=\321\370\025\275H\243\303\272*\355\250\274\333_\345<\337\243\236=-\027\374<nV)\274\274_%\276\244B\364\275\226r\026>c\177\007=\nsj=\221\377\017=\357\331\206\275\023?\321;\013\017\007=\340\321u\273\253\267\"\275\353`\216\275!\266\230\275\363O\000\276Y\214_\276/\250\270\275Ns\035=\035\372\003=aEw\273\220*\363\274\343\354\241\275\316\305\330\275\201\020V=\002m\305;i\231\220=\246\302:\275\322\335;\275\332\201\315\275\007`\264\275\230<\013=\340\033\253\275\301D=\274\'LJ=\366\234\r=\256G\221\274\373 I\275\313\022a\274\302x\247\274\270\362S\274\223b\267<\371J\325\274\244\030\002\275\376LC\274\037\260\256\274\310\3626\275\344-p\273\227\250-=g5\203=3\312\274\275\321C\025\275K.\363\274\032KC\275r\014\021\275h=\230<f\200}<\320\305E\275\004\264\230\275\304bY\275\016\3178=V=;\275\251\3062\275O\034\204\275v\330\262\275\032\206\276\275[\324N\2751&\023=\\\267\371;\332\224\276\274\006D\032\274Z\367\331<\270\262B=\254B\300=\226\224\216=\217!|=\306\267\024\275{\t\276\275|\014\310\275\242\276\347<\350d\230\274\242\000\261<\253\332=\273\231\214d\275\366\010h;\010 p=\265\323\315;r\245\030\275\344\027\244=\204O\206=\264W\374:\224<\377<\3079E<ZX\013\275\334\201f=8\'\346<R\335\235:\365\257\204\274\300R8\275j\327\304=\360h\002=e\255\013<KG\005>\021\312\321=\336\307o=8\224\372\273\322\340\346\274P\237\217;\235\264B=.pz\273D\344C\275\354\027i=\263\200J\274\017\272.=\241\312\240;\3161X=\315\213\332<QUT\275\333,\030=\330\364I\274\202\256\221\275\311\266\355\274i\320\240\275\274!Q\275K\251\204\275\314z\022=m\\\340\274A\375\270\274\313]\013=i\t\326<\250\177%\275g~)=\273\226\213=\256\000\360\274?\327y=c\277d\275\234\204+\275\263D\225\275\362xQ=\356\225\226<!K\215=BE/\273\224\345\224<\3012\222\2757\016\234\275\234n:=\345l\034=P\014\276<\355?\006\274\256\311]<\307\225\302;\362\003D<`+\205\275\330\257t=X\tm=i\331\300=\371\2252=\313\350\335\275\241\363\005\274W%\241\275\366bV=.Y\026<-d\241=c\'.\273^\257\t=N\233H\275\271 \212\275\r\274,=\017\364\212=\000\374)=Ua}\275\333\321\237<\342\271\275\272\021\260\014\274F\264d\274\333lQ=\342\206\255\274\007\025\216=\267.\216\275\242\261\035=\342\024\233<{h\"\274\271\344\253<\274\375\236\275\254\210\342<\327\335\325=\327\327\226\274\255s\217=\000\202\215\274\340\234\364<\342\336\311<S.g=\002\3528=\372\177\250\275\352)b<PR\036=\010\253\273;\265\371\336=q\244\n>\246\217\320=!\252\177<\221\355\335=+m!\275\302\302\267\275\241\356\200=\010L\344<\n\256\216<\3643F<M<\031\275B\264B=.\221A\274\376\002\346=\037\301\342=P\006\202\274-?\326\275\373-%\275;\306\020>T\361\224=[(\257<B\341\233\275\340\000p\275\007s\333\274I\226Q\275\346v\022\275S\344#\275\332@\001=\253|\213\275`H\003\276\326\213\371\274\314\317\253\273\326 R>\272\2231>\226r\022\275HK\371\275\222\240\236\275\350\204W\275\215\020\223<\340\312\201\275\245\275f\275L\201\253\2744cz\275\001\246\372\275\333\021\233\275\357\360\346=6\307\254=\227\341\240\274\002\374\261\275\235[\205\2750\227\233\271\227\276\221<\334;\310<\377)\006\2748Q\237\275c6\300<\303\037Q=\265\346\346;0L\373=\263\342\307=\325\272@\275j;w\275\026\234\277\275\275\001\253\275\311\313\221<w\032\205\275\376\323l=\225\2113\275:\340:\271/\256\031\274\246.\222<fu\010>\216\025Q<\350\203I\273f#l\274\26465=\177L\224\275\0053\210\275\303_w\275\264\211:\275M\243\016\275\346\307\204\274\224:\267\274>\317\036=\351x\026=0\352#<\334\361><xJo<\2171\006\275\366\357\224<t\306\036\275<z\225\275?\370\210\275Bm\017\275T\234\364\274\242\265\326\273\3705\366\274 \364\276;]\333E\275\"\376\244<\217z\223\274\331\305y\275\n\345\304<f\256\371\273G\\\201\275\332e\\\275\"\313\373<=\245\300<\037#?=?\036o\274\022\354&=\234\307\327<\315\001O<\\\231\326\274Q\263t=\323\301\351;\355\343\345\274c\3560\274%\322y={4\037=\261\355k\274\255\206y=)\245\266<SiB\275\317\345\231\275\276i\005=t\004p=\371|1\275Q\270\327<\344\337\310;?^\352\274g\234\036\275\366\3106;\242\031\210;C< =\253\232\213<\021A\273<uo8=\365X\225<:\340\371<8\005~\274\325:m=\200\305\010=L\023\200=\335<\244=\343\237\255\274\002\341L=X\335\217\274\0233e=U{@=\234\230\031\275\2405\204\273\354\37069\350g\317;K*\n=^\222`=\234\270\255\274\201\037\251\275\364\037\255\274\361\326\006=\333.r\273\206\361\201=\234\215`=\024\177\026=O\221\242<\370\326/\275\342\030\270=\244\202J\274^:\231=)K\013<B\020\025=\244\226{\275_\233I\2751\230\252\274\304X\367\274\234\263\304\274\271V\220=+\271s\274\253\323C<\213k\256\275A\033a<\241\256\276\274i\034p\275\301\354\305;\333\206\035\275\270\255u=8%\247\275S\372\235\275\246\371\270\275.\350\216<\337\245U\274\303/\232\275\346\307c;8\345v\275\275d\252\275\"9\330\275w\335\344\275\325\214\033\275\2150\214\275\024\331O=\005\017\177=:\002S\275\365\372\256\275Dl\335\274\010G\226\275m\267N<\232\263\"\275\370\236\245\275\006\016\001\276\000\351\":\263\345\327\274p\355\331\274|B\224<1\351T\275\253 \246\275<Y(=\301%E\275\251\027;=\027ZI=\262la\275\232M^\275\274z\331\274\247\354\302<:\363x\274\313\320\305:6\367\010>\337\324\000>*;:=\313\337\204\275h7\225;H\327$;\236J\275=\317-\023\275r\344L\275\0176\220\274F;\\<\235#Z=\036vP<\233\232\265\274\030\032\361=ed\265=>$\325\271&v\215\275s\033\\=\272H\252=3@x=\306\366\002\275\253\365\216\273\234S \275\375\"\304=\226\177\r>\333|\224=\316\231\211<\\\234\256=\300\016G=R\372\010=\324O\264\274\016\245[=\2507~<\265\224A\275\300-j\275\253[\255<,\212\247<;\226Z\275D\270\233=\274\020\312=\235\332\244=F\210\330<>\273\024\275\211\212\372<\261G\247=\320\324\207=1o\035\275J\007\322\274\247\223C=\251\2779=\253V\021=\346\217%\275D\334\362\274.\214w\275\267[0\275\215\245\216=~\231%\275u&\r\275\016\221x\274\324\210z\275\225[P;\334U\257\274\317m\237<_\350\202\275\373\320D:\375#\227\275\223+\020=\257\260r=\221\365\021\275\274\247@;\236\227+\275z\370p\2750\322K\275R\2166\275\321F\216;w\256\215\274IK\206\273\323\270c\275\255S;\275~f\200\275\263\310\\\275\311\303j=\021;\264<3 \220\275\341\263K\274\211\333\276;\230\014\025=G\210\203=D\342\204<\005\225J=-@\327\274\0233Q\273\350K4\275\332T\177<\353]t=\301!\273<\377\257\323<\203!\214\275\030\362\032\275\270f0\274\342<(<\'x\360\275\034C\210\275\261\363\020;\233W-\275+\216\323<A\311\270\273\370i8\274\030\000a=L\240\232=\364\023\274=D\375\346=_\315\271=\371\245\362=\031\301\225=\276%z\275\201/\354<\227\204\207<y\324\360\274\3476\221\274q\037n\274\377\265\333\274[8\312<mR\210=\204g\312=e!*=\r\243\004\276\001a\n\275\246\216\223\273\n\000\321=\313[\376<?\251`=P\234\204=\304\252\367<+i\373\274t\203\242\274I?\022=C\035H=\2001!\275\237X\311\275N=\n\276\010\2266\275\226 \024>7G\t=\305U\264=\315\003\025=\361\005\256;\356\243\032\275\345\213\320<\000`?\275\275\201\225\275\244\322w\275R\214\017\275\244Sm=k\351A\275`\202\020<Q\250\316=\316o\303:\251\242\007=\353\256\016<\tyS\275\366\360j<\240\000==d\217\230\275\206C\352\274~\373\264:Y\377\316=z\272\025>r\265\217\274\000R\354\274xK\001=\275\315\315\275\305Z\013\276\005\272<\275\275r=\2754F\253<\363Jm=\356\245}=\017\360T\275\371Z\317<\210N\307=D\177\226=\341\207U=#\005_=\256\367\204=|\350\216<\243\204.\274)\2438\2756e\030\275\310\257\014\275\237\312\223=U\225]<\241\212\026;\221h\003\276\005\276\212\275\r\017\232\274\251\336\271\274\324]\226=\317\252\202\275\215\2338\274G\361V\273^\213\207\275CF?=0\317\303\274\237\331_=\270\r\343=\227\247\005>Q\364\361\273\2376\342\274:bB;\307\321\257\274\020]\253\273=\006\216\274%\247\016=\277\003\'=\324\006\210\275K\340S=\276l+<\001D\\\275h\377\230=\255\266\367=\223=\036=\325(j\274\253\250\332\275V\002\004\276\266\037M\273\3265\226=\024\277\005<\231\264h=\001\305\204<}\356X\274\035\344\262\271\223\316\014=\000WR\275\251\206]=\244\215w=\367\224U=m^\010>\233\344\312=|\257\032=LO\302=\235\203 =\331\226\022=c|e=\275\262$\275\007\307\013;\336\327\215=$l\227\275\3751I\275\254-a=<w\224=Ym\231=\364\357z=F\370W=\035\2070\275\336\344v\275\313\316\223\275\001\034\207=ykd=\013\024\341<\377\207\233\274mM_=\276\017\013\275\242\352\231<~\254,\275\377\025\227\275\376qd\275\2504I\275Y\374\274\275\354\206J<D7\277\274\326\337\002=\021\0067=\321\236\237\274\2271\331<\352G\311;\2401#=\\\351]\275\377+u\2748;\003\27544`=\003g\222\275\302|G\275\325\230H\272\2543b=\222\251$=\006\211\231\275\274\375n\275\014\020{=o\366\357:\271\240\220\275\'q\014\275\310\237\203<\310\"2\271\227\003\n\275p\325\035\275\273\023e\275q\256+\275V\345?\273m\316\232<\234\364/\275\203\304\244\274\030\r\201\275\221\207E=\177\375\214=\223?\200=\270]\014=\320\203\355<&\031f=>\322K=Bw\236\275<M\343\27486\241\275\010j\254\275\037\243\037\274\003\031\374\2740,]\275;\317\035<)\035\273\273\225#\023;\260\253\304\274\305+C\275F}\205\274\342\211y\275F\204\350\274W\267H=\364\354`<\242\254N=\204\021\246\274\377\323\204\275A%\367;\301-\023\275\000\r\005<\330\342\212\275\203J[=g\265\207\275\257Kh=CA<=\n5\232=|c\211=p<\033=\212\360<=\370\252\270;\235\350\025\275\005\177\224\275\r\te=k\'\274\274]\253P\274\2161\031\275\252\332\\\274\221a\013\275K~\205\275\330\361U=NW\335:\026\233l\274\266\307\206\275\310\327*;\275\346\231\275\364\020\227\274\017\227\345\274\366\227\241\275\235K\256\275\234\221\261<\336\360\t>\253\024\364=\002\246q\275\265\214\225\274\331\027\317\275\212\243\001\276d3d\275\366\357{=\032\270\332\274Q!3\273\326We=\351p\373;\255x\215=a\022\240=I\216\355=\241!9=Z\225S\275\3645\214\275y\000\361\274u\2136=\364r\006=\030z|<\334 ~\275\207\227=\275\021Z\235=\241j\201\274\205\006\376\275\276(\320\275\316\356\002\275\035\3250=\236\262\323<e\230\216<\231\362\327\274\027\376\375<R4\275\274\300v4=\351$\335<\215\215o=\372\207\371=,\262\255=\363?\254\275C\317C\275&T]\275\247\264a=\266h\276<\227V\270=\233F\325\273\213\316\336\274K\306!\274\253;\222;\233\0305=\356\375\214=p\025\306=\320\366\247=\021|\365;\377+]\274\316\025@\275\304\215\226:\331n@\275y\271!=pb\235=\216\370\244=\036t\233\275;oO=\034\025Y\275a\025\246\273\t\r\244=\\$(=\230\362\213\274\345\312\034=\032\346\267\275Q>A=\304=\224=\203;\236<(\323\013=(\n\230\274\201K`\275\262\306$\275C\345R\274Z{\210\275\274C\204\275\246%*\273\024\346Z\275\364r\334\274\366\304\301<\014\032\277\274\223\256`=I\207\032\275\251\252O\275w\027\347\274\355\'\210\275\3213\353<\346\024Z=\320AJ\275\017\037\030\275\341\214W=\206\334\210\275\223YC;\315\223\232\275\255Z\265\275<\313\326\274R\225\203\275\367m\325<\371\264\371\274\321l\363\273&\n:\275)\036\216<\264\347]=\261@\272\274\232\303a\275\356_\245\275g\250o=@\004\254<\231k\231<x\261\2359\013\257\307<\236>e<\023V\300<J\317\005=Z\325\365\272z\325J=\273\001\004=\013\326^\274\375M#\275\261\"\375;\006l\252=\004\207\254=\212)r:k3\n;\347\361\025=oT\325<;\264~=\256K\304<4)0<7\231\223;\246\233\242\275\273\014\026\275j\373\226\273\341\355_\275\277_\230\275\241\\\362\274\267\035\263\275\255k\024\276:\344\200\275\255LZ\273^=h:Nc@=\261\243&\275\321\306\242<\211\210\204\275\274\371\245:j-\003\274\214\031N=\325\341\264=\024j\017=\214\371\334\274n\307\231<\264\217:\274\222\254\370\274\332k\236\2752\204\247<q\234\026=\302\213E=\251\032\r\275g\311\230=\305\017\000=$W>=h0\035=a2\210=&\235G=\243\232\245=X53\275h\014^=b\275\201\275\343\347\200\275gE\203\275B+\031=\352\343z=\350\336\020\275\335A\300\273\3279\377=\200f\020=`\203\247=\343_\271<\210O\000>\202\034\301=\232\n*=\335\355C<`\247\247<N2\345;\007\026\036<T\214)\273\035^\205\274\312\310\240\273\\S\262=\304\230\247\275\237\364\312\275\352@n=\206\333W=\244N\236=7\232F=(\227.<\253U\364<kH\320<\"7V\275\211|$\275\356\354u\275\227\007f\275\2363,=kZ\033\276\253\267\036\276\262\343\215\272\326K\035=\224\245\223=\367s\365=\357\013\"=\327\246\006=\004\026[:\232`W\274Y\356\275;J\353\351<N\027d<\024 >=8\362V\275\213\016P\275\255>4=\'\326\013\275\333\256r=F=\354=D>\034\275wK.\275J\007\227\274\334\324F<4N\326<H\t\332\273Uo\\<\353_y\275Q.R\274XO\037\275\352\3551=\214\332\n\274\316\311\337\274x\250[\2727`%<\375\344\376\274\035fD\274\0009@\274\031.\010=~\336\224\274j\232\264\275\213\007\217\275\262x\270\273\347hl<\342{\272=\357\020\267\274\316\225\374<yS\307\275\361\205\337\275k\340\300\274\033\013n\275ry\006\275\325f<\273\247\275\210\275\367\313c=\2015\006\275\327\372Q=\255\331\303\274\341<\231\275\016#\332\2752\377E\275\206&\251\275M\360\021=\373\237\225\275\314+\000\2754iR\275g\010h\275\360\356\271\274`\377e=!\225\223=\002\224D=\215\220f=\214\353\241\273\266X\367\274nV\312\274v\304R=q\006\256\2741\242\223\275Zf4=[&\260;Y\330\010:\001b\002<\262\247\203=;\223~;\315\203\317=>S\356=\300\247&=(\344\266=p\003l=\344\355\201=%\352\335\274\2156_\275\226\305\035\275?A}\275Q\2530\274\207\333c=\037\323c=e\225$=\203e\350\273\033nL\274\276\257\n=\246$\346<r\237\243\274\032\207\376\274\352\006v<y\266\200\274\237\337\201\275E\321?\275\246+7=\270p==\213 6\275\321s)\275_,\217\275\006\257s\275\035~\025=1\341\262\275}7\341<$\026\232\275\221\366c\275N|\010\275\231m\010\274\\o\313\274\322\023?\275w\354\032\275&\301i\275\257j\252\275\331\322\177\275@\266\214=(\177\302\273zze\274\365P\257=\352Zd=\3072\260=\274{~\275;w\245\275a\310\202\275\2358X\275\373\003\216\274i\022U\273\375i\230<\267\236w\275\340X\304<d\212\312\275\355dk\274v\003t=\030\232\r=\264\230\234=K\361Q=\271\270>=b\355\263:\370\303*={\315 \274\2522\230\275\037\262\311\274\325\3138\275\371\254{<\255|r\275\031\';=\375\273\234\274\340\217\351<\242g\022\275\'B\002>\354\200\247<\307\355\325<?\031\257\275pz\350\275\240\237\212\274\016=\310\275\007\300\016=\336y\354<\273\265K<9\020\333<\340A\327\273{\317\247\275Q\327\347\275\\\217\243\274\322\326\330\273\261\370\266<\364\203\246\275\226\004b\275\346\317\203\275\276\023`=_\037\036>\245}p>I\220\020>J\347M\275\030\307\210\275 !\370\275\225[\254\275+vO\275\374\254s\275\244\200&\275\235m\235\274\2079\022=\222\327\332\273\301\306\357=s\221\214=\220\273w=\360\334\200\275V\2038\275*/;=_\361\034<!\371H=,K\314<\237\366\267\275\244\350\214\274fX\216\274=\rI\275\002\354\264\275\017&\301\275x\377\205\275U\326O\275\331[\024=0\2638<\324\220\310=\267\260\245=\372\317q\274X\330t\275q]\257\275\275\262z\274\241\364\033\274\3664\317;\225\260\355\274\3100\261\275$I&\276\346k\335\275\001\212\244<\315\007&=\302S\301=|\013,=\346f\223\274y^\261\275M\024\357\273M)\177\275.\re=2\260\276=\255bo<\026\331e=\325\262\220=+\010\207:\341\325#<\241\336\\=\237\253\305<<P\244\275\231\026V\275\235\325\200\275\241v\n=\326Qz\274\252}-=\001#\224=\356\216\341\274z\250I=\247S\026=\344q\220<\306\253\307<_\010P=\315vD=\010(\263:\231\202L\274\340\034\312<\213\270\212<2\343\204<\0171\022<\201\no\275\313\276\021\275\377\023]\275?\274\203=\331[a:\252\264\342\273\2173\260<\345@\302<\221\376\240\275x\022\331<_^\366\274\307O\010;9{m\275r\202\305\274\261\307\350\272G\214\304<T\242\036\274K\345\275\275\335\354\300\275q=\250\275\344\261w\275\206\326\240\274\241\t\302\2753w\235\274J\243/\2749\327>\275u\336A=\212\034\345\274\333\352\235\275\177\355S\275\tx\337\273\273`}\275\002\265\377;\021sw=\023H\261\273|p\334\274i~m=\333\2512=\260\206\035=s2k\273\023$\274\273\3206\203\2753\001\005\273\024\'v=\206x\025\274\341w\227\275[^0=@7\211=\205\355V=\204\351\254\274P\221\324\273\025|\000;\227a\025\2752m\237\274\347\311I=\313\371\366\272\036dd=\306\037Y\275\302\002\273\274IZ\013<wkX<=\005\r>\266\233\005>\247\"\247<\317\361\207=\005{I=\366\356k\275<\332Y\274IC\177=\325\237\\\275\242\241y\274w\205}\275\013\317\210<_\200\235\274\312\266\216:\230vw=\211\373n=xH\352:\371\256j=\027\344c<\257j6\274\313\330Z<\225\2515\275I\346\372\274\231\3453=Su[\274\020\363A\275\353^S\274\3522q<\315\001\034\274#t\361=\025\017\t>4w\324<3\212-=\336\3078\275XO\362<\231\312\234\2754a\205=\021\350>\275\036K\000\274<\035\3769\310|\353\272Z\037?\275<Si\275\303\356\214\274\310\025\276=Q\243\325=$\362\211=\331\004W\275\300T\254<\200Ej=\346\213\337\274\344-\245<mi\000\275\314q\357<Vj\260\274#\300\357\275\267\261#\276\341\266\024\276\024\340\023<\327T\233=\303\034>=\206p\265<5\374I\272\360\0372\275\212\376K\274x\240V=\020\316\356=]\267\222\274\355]J<\032\003\371\275\235~\013\276Y0V\275\210!D\274\353\256\177=7a\267=[\036e\274\030-\216\274]\352\376\274\003\334N\274L\030\223=\306#\376=\017\367\'\275\352\332\307<_\367\345\275\024E\332\275\265\215\230=\031\013\307<\035\300\237\274T\205\306<\306Y\235\274\211k\226\275\360r=\275\035\373A\275Zc\204<\204G\"\2749\021\262\274Q\035\273=\255e\034\275\325l\257<7I\301=/E=\274\202\344\203\275\250\006\242;x-h=\275\243\206\274|\347V\274\013\366\276<\204\250\215<\313\364D=g\222\341=\005<\010>\224H\240<\237\363\225<@\251\221=\267\tp<\321z0\272Z\256;=\037\370\025=\336\226\243<\n\031s=\230\270\216\275\r\272\206<\230\030{=\221)H=\343_(= wk=H\006\366\274F\352\373\272\006\307Z=\0224L\275\216B.\275#\377\317<!u\335\274sw\302:\205P\242\275\004O$=\247\351y\275=\2049<\315\261~\275M\327\216\275\302\252\024=\236\027\215\275\375c4\275N\266\343\274O\264:=G\251\\<\364\340\324<\304\016\"\275*5\t\275\316\2147=4\316\310<\014l\303<\204B\\\275\370\240\216\275\363\004\250;\010\327o\275\234&\034=8h==\016\351\035\275\344xa\275tSv=L\2748\275\330\351\202\275\352\364p\275r#\326;\325M\375;\t\361\'=W\376Y=\275@\306<\254\241\251;{oj=\027\375\023\275jP\233\274\300\033[=\250:\376\274h7\000=\234e\007<\031-\226<\345+\215\274\311.P\275\347\244\243=\234>\325=h\006\256\274\340V\210\271\006\340\004<\246C\376<\027tU\274\034\205\021\275jKG=\340\203/\275\006`j=\210\2374\274\213\270*=\002\\,=\271\260\243<\355g}=\016`f<\226C\210=\324\340\340<\200\325T\275\233\344F;A\326\220\275Mo\000=\313Y\266\274\202^(<\356\226\010\275\342\351;\274\005\210\273\274}~0=G;\223=\315\2076=\275\207\332=L\342\'\2756f\013\275Z\n\030\275\266/\024=\232[n<^\r@\275\230,\270\271\313\331H\275\234J\304<\016&\034=\332\327)=\260\033\025<x\356\364=c\244\251=F`F\275L\254\263<O\333C\275\"H\014\275\261\023n=\364^\227\275\n:\274\274j\356\317<(2\326<\223\276\253\274\300\321\205\275x\210o\275\317\nf\275\274\017\362\273\206\302\352\273a\330\274<\321\262\212=\272\343\200\275\007\206*\275B\032~\275\rK\007=.\347\235<c\000\365\275\345uE;\000\0052\272\257-\207\275B\203\250=\217\337\\=UA*=g\034\215=\013\2715\275\342\262\307\274(<\017=\240{\224\275t\024\235\275\240\205\226\274\244\252\006\275\311\"6\274`x\371\274~\2511>k=B=5|\242\273QD\240\275\376W\036\276\325\035\215\275\237u7\275L\361/=\300\213}=\354\342\345<\354\277\242=i\321\373\274\356h%=8\005\244=\023\025==\rxo=l\232R\274\270\240\254\274\3514\023\276Sd\226\275\337\226\013\275\253+\276\273\254\34079\245\315S\275\376\251\350<\365\373\363=\305\252O=i\353`=\205\006\354<\330\373\025=\205L\010<H\250\342=W.K=\373\027\237=9\210\272=B\007t=\333\266f\275\365\322\275<\037R\324\274\332\316\360=\270V$=\004|D=B\273\307\274{\272\312=Q\212\317=LE\334=\302\3578;\320\003\324=\234\310\245\274\357\332\224\275J\321!=&wn<R\273\252\274\222\266%\275?\330\221<\3579*\275\0240x\275\363\221\025\275,\246\263\275\000A\177=9\227\273\274\270\033\005\272v;\210\275;\356\212\274\351\365\355\274\203j\375<\300\324\017\275\222\344=<\004v\246<N\307\212\273\031\3702\275\247\240\275\275\250X[\275]]\021\274\010v\r\275Y\252/=\220\037\336\274\370[\033\274Q\273\203\273X\273\214\275\232CO=`g!\275k\274t\275\271a\345;\215\324/\275eH\213<|\347\013\275\366/\004\273\357v\217\274xo>=\3240E=l\262\202=\250\3277<\361YH=i^b\275r\2076\275\346e)=?\221\233<\376\337\274<\014\2534=\220>F=\350\366\026=\253\365\274\274\207\375\235\274\237\262\226<\250\205~=\254\000\007\273\363\274\222\274V\253/=\316\313I=$w\243\273\253\037\322\274.\222\222\275O\262|\272\224\000u<\302\335U\275\214\243u\275\362\263\245\275g\372]=}\020\220=\307\243\227=\2340\212=\315\351L:\005n\373<\266\251\243<\252\322\013\275sA\201\275K\332\254;\236\315\n\275\0308\276<5n\267\274w}\311\274\356\032U\273\002\244\343;9d;=\230\204<=\326\010\251\274A2\347<WC:\275\344Of=\027\252k=W\274\020>;k\033>\340F\\<\360;\213=v4P\275\301\330-<\275G\315\274\315{J;\270sj\275$\264\036;\366\270\302\275\0207\314:\031t\201\273\261`\007\273\321hY=\254O\251\275\205_\337\275P\270\220\275`\005d\275\274\307$\275\364g\205<\343\272\037;j\243R=K\201q\274\3672\374\274\241x\036=\202\313\362;\366\000\206\275Z\260\217\2754dW\275K\364\336\275\301\207\367\275\200U\363\275\377\035\256\275B\026\213\274)4\345<\362\'\234\275q}\235\275\271\005\010\275\220G\235\274f\236\350=\\\005\037>\t\215K>)\016\021=\260\342\006<\212\214z=M\230\307\275V\370\222\272:\305\027=E%\322<(\335\227<\305\354\250\275k\244\233\275k\246\010\275\272q\031>\325\222_=#5\006\274\356B\230=\n\357\224=\324\365x\275\226;\226\275\340g\023=Q\277\244<CDP\275`\311\225=\365\350\241\275\213\275\270\275\214\306\014\276l\255 \275\220$\311\275?\366\224\275e\0149\275A\235\026=&\233\024<.%X=\tz[\275\n,\213=\305\257P=\267\266\367;S3.=\\[#\276\361\271\201\276\030\005\211\276\307\371\212\276a\200\371\274c\200\336;\325\325=\274\345Hs=\360\237t<q\243V\275\215\001\213\2747J|\274\300M\177=g@\312=\211\326v=\304\250\242\275\372\232T\275\250\347\316\274\340&\315\274lXS=\304\242\352\274H\004\226<d\367\222\275\235\320\036=Kc7\2751\033\327:\364\3311\275\033.\303=\202:i=0\206\014>\007\030\216=\001\025\204=\245\032~<\025\307h<\2430\233<\232\377\311\273\315\363W\274\017K\253<\351\'\267\274!\244\322\274 \033v\275<F4\275\006\315)=\3336\337=`\361\363=\230u\252=\232 \222<ye%\275\024\330\237\275N\364\211=\252\3064\275\374\270\n;^\345\000=\017x\261<O\257\342\274x\235j\275,\037\203=\270U)<\214|\240=\267\244 =3\006\254<wU\025<\207NK\274\311\351\030\2757m><\377o\223=5!==\374z\202=\216\304\206=(\320_=\200;\'\275,Y\036\275\373B\201:\210b\377\274\252\317\235\274\306\266\325\274\351D~=\364\231\205\273\340>\215=\345\263g\275\026\270\222\275\323\365\023<\222[]<\373P\362\274\226\010\007\275\t\250\005=\337\220\256<\305\3406\274\354\316\341<q\331:\275f1?= \261\016\275\231\177\274\274\016Y\347<OO/=\031\310\006\273\250<o\275\033)\225\274\276\016c\275\231a]\275\020\020\206\272\324Rp=D\246G=\035U\r<l7\316:\317??\274\240\263[\275\250\263\352<\221\302 =5VX=\020\227\314\270\002\321\215\275\022\246\271\275\337\341\325\274\245\352\261\275\025\366\301<\224\230y\275<A\230\275$\270q\275\210\373^=\177\346H=!\356\016<\254\023\240\273\327!w=\316\r\014=\014su;i\261`\275S\351\031=m\337\275=\360\277I\275b\306\307<\366_\250\275\025c\302\274\"\360\277\274\2402\333;\354\354\345<\033E7\275x\312\001=\025\252Y<\203\275\023\274\2070\267\273\233u\035>pL\332<\325\006(=\302\202\363=`Hu\275:\333$=\320\260e=\211\256\010=\211\023O\274rV%\275\372!\261<\260\342\210=\222\370\234;Y\217g<\320\006(9\324\234\254\275J\251\334=\036\215==\241V\264\275y!\351\275xou=\225\t\033>\031\365\354=<\010\013\274\2057}\274;\247\201<e\367\242\274\tRi\275\310\235\376\274\343\217\373\274\037>\026=O\245\235=\223\325\254\275\260\253\363\275\334;\n\275\203\372\365=\255\371n=8\357\257\273F\004[\275\333\306N\275a\177o\275\r\036\302\275\035\214\022=\037\035\013>V\232\005>\240\213q\274\261<\263\275\361k\003=*\322\026\275G\206\217\275\004\364V:\307\027z\273\220\324\342\274F(1\275\335\037\010\276\372p\246:6`\004=N\036\032>\3565%>4\3525\275\317vh\275X9\255\272\227A\006\275\222\212\205<jb\236\274\n(!<\244`\253\274@#\310\273 a\342\274\274\325\216\275\\\276\226=\354U\233=\347\243,>`+\000\275\333y\342<\020\013\244<S\255\333\272\344s\016\275\355\177S\275}\256e\275asb\275\227\333(==\262\272\275\005><\275\366\326\264<W\215,=i\300\310<\004Q\017><(\230=\306\211:=\322<\210\275\371F\255;\222\372U\274*N\200=\202\322\n\274\225\034<\275Z7e\2743\337\261\275`\355\203\274q\242\221<\357\251u\275q\023\326\2748\273\014:\'U\355\274\372/\031\275=\030J=\232w\357<\014\322\313\274\223=\026<\333bG\274_\336V\275\272\324\271<\030\331~\275\252\235K\274X(\306<\235\362\244\275yC5\274\327\355X=\235\254\324<\000W\356\274\317\302$<r\306\213\275\301h\265<\031\r\225=\013\374\224=R4\034<-\302\025=,B\304\271\036S\002\274\316\207F<W\347\000\275h\031#=]\363<=\213K\n\274r\274\266\273\236& \275\351D\242<\217\023 =\025\001\241=?\262g\275\243\314X\275\376\347\353;\025n\211=\361\212\357;\224P\260<\231\312\224<\010La<PT\227=\267\227\211=\240\267\371\274\366|\003\275\251\2377\275\250x\314\273\316\301\247;>\273^=\327\202\250\275Vw\360<X\272\202\275\315\267\035\274~\000\'<\"\225i=\234r\200\275\217\275U\275\016\3245<:\027?=A\001\317\274\026\363\257;\374\203\273\275!01\276\234\014\267\275i\353\361\274s\201\017>\270-\374=\032\024\235=i\006\236<2\032\004\276\227\332\366\275&\014\350;\357\333\370<8\035g\275|x\030<_\231\330\275\3712\344\275\272\364\245\274\304\013m=\0015\204=sH\035\275\370@\024\275\223|\014\276\302\235\216\275p\230k\275\006[\264\274\211\233@\275\021\216*=\003j\314\275?\022k\275+3?=\303\375\266\274\213cX\274\350J\222=p\t\202\275\213\257\036<2\220\253=T\374\233\274?\312\234\274\300h\277\274\214\352U\275\262\260\371;%\273q\275>\367,\275\356;w\274\006\242\271=rM\234=\360\0203>{}\353<7B\277=\376\222\260=\306s\'\2758\233\337<\"\264\354\2744\335W<\233\267\277\274\222\006\224\275\036\270\177\274r\271\334\274\346=\001>H\2232>\230\004V<L\352\357\274Q\272\306\275\236\245\275\275H\372\323\275\205w\330\273Dp\316<c\'\225=\224\223O<Jeo\275{\235\303\275\371\214\223;c\223\270=\350S\304\275\355y\275\275+-\324<\354\037\177\275\260;\332\275\001\271\323\275\264u\205\275\370\3458\275\311\257\007\275B\331\200\275\307m\274\275k \037\275\002!\201\275\002\267\332<\361\215\326\275\000\371\010;\266\265s<\310\\\301\275\236\016p\275;/\232<uc\'\275\216\005\233=\210VO;H6\206\274\327\305\023<\026\262,\275\373(\003\275\203U0\2752L\223\275\006\214\314<\374\017<<\3779\240\275\212f\230\272uQ\372\274\373\303i\275\340\257\250\274F\372\020\275\246G\025=l\0169\275\0106\373\274\201\022\220\274k/\375<\031\347\020\275\263\014t=b!k\275?4\242\275.;\000<\365\363\033\275\324iw=&\200*=\273\217\304\274\256\260\271\273\221\332\236\274\353\303\250;\277kw\273s\217\014<j\340L\275\315F\315\275\252)H\2753\301\001=E\350\252<J\233\301\274PMv\271\215\331\016<\265\023}=\037lZ\275 W\231\274\301\223\275\2737\272\273\2735\257\235\274V\374}=\267\024\210\274\036\263\003=*\354\016\274[\177\265=\320v\002\275]*\215\273\311\021\213=\366\370:<\375\360\273\275\245\216\223<\003(\206\275\303\n\024\275p\237\034;\204v\264\274C\201\350<m\270S\275[\030\240\275\2321\304\274)f=\27376\330<[h\202\275S\351\020\275\255s\214\2759\307\243\275\216\310\254\275\0249\244\275\245\253\177\275\213\372B=\346\035\331;\3001\370<\3525\214\274X\200\023\276]\306?\275CAp;\014\275\256\275G\241D\275\253\310\324<\266\235\217\275\013E\231=\260\n\242<b-B=\352\214\004>FQ\263<\326&\347=0\245\236\275.s\002\275\273\240\177\275\005[\210<\234M\355\274\375\207\306\275n\037!\274g\222\255=\234-\202=\206\334\255\274\366\306\014=\345\256\372<\263\252\243<^\230\217=\351@\035=\025!\013=\346b\266\274B^\250\273D\340\033\274`\274 ;\007\366\035\274\021\264\214=\036\266\306=\201\333\300\273,\036\255\275X2\267<@\036f>J\245\036>\352+\373=\023b9<\345\216\373\273\301C\032=\016ae\275T\2017\275\212\362I\273\322\014B\273!n\354\275\342\307\320\275n\r\023\276\227~\335\275\346\332\010>=j\245=A\2612\275I\034&\274\016\000\363\275$\323:=\211 \027=\244\362\237\274\252\372\322\273\310u\315\275\311T*\276\200\263\t\276bR?\275\333\010l\275\300P\273\275\320\252\270\275\311 \250\275]x\004\276e\363\004\276\240\276\001\273\304^\265\275\021\351\314<n\035|<\210\343%\275v\371$<\t\0347=\320\276\322\274\033\035\225\275k\335\005\276\252\261\214\275\244>\236\273\000\337\335\272(\035;\275\357ax=0(\033=\327O\035=\307v\250<\212W\333=\323T\207=o\360\211\273&\226\326\275\364\016\243\275Tdo<\214\343\262<\332\301&=\270` >^\017$>\216\2345<\371\257\253\275,\014\"\275\207]\353\274t\020J>\324{\201=\337\005y\275\326\3741\275\356h\017\275\000\243\014=\207\225\365=-\003\361\272\371v\275=\013\252>=)Ve=.\225K\275E\270\033=\333E\345\271\373{\334=u\326\224=\346\032->[\253\016<\304\313f=a\217C=\027\254\312=\270\363\314=4\250\276<$ON=\362\357><\023\372\301\275\020\2237<\306(\200\275@\260\244=)\007\033>\320\177\244=\314E\233=jy\317<g\014)=\273N\363=\335@\363;\325*A=z\236\253\275\265\375F\274\002\261\300\275\233\320\234\274w\\C<{`\210\275\260\347\2249\304!\342\274\266\021k=\275\325\302;R\301\203=\273\360\211\275\200\025-\275%\355\033\273\313{B\275ly`\275\333\332g\275\321\036\257<\234\211-:\350p\270\274i\250\215<\306\347s\275]\016\227\275\033\027+\275)\325-=5\240\236\275\'\324q\275\213\341d\274\020\234\367\267f\013\t<\033\344\274\273Bi\217\275\311\272\367\274pF\027=]&\256;\250\362\003=\277\254==\366f\007=c\014\022\275\323x\034\2751\r\237\274\0164&\274\300\000Z\274sH\251\274vp);\300x\033=\330#e\275\325\206\353<W\265\240\275\251\320\212\273\244\253\243\2755\232k=\233?\236\275\344\241\213\275\323\010\\\274\213\230+\274_\343\006=\016\263\372;\206\021\222\275\006\303i\275P\016,=\307\317\254\275\037Fp=\203i\\\274\211\235\343<k\355a=\363\375\214=_\344u<+l\217<\026\321\r\275V\347\322;\005\033E=@\363\316\266\355\211\201\275\235\377\202\275\224\253\007=\306B\253<\201\277\306\274r@-\275%\024\025\275\001oc=Yj\320\275i\213L\275\021\354\031=R\213v=,N\014\275\\\007\231\275\034?\037<Ld3\274@\304u\273O\014\203\275\177K%=\323\225\242<\251E\247;\215\250\203=\025\200\232=\321\260Y\274\242d\001;\303\304X\275?6\204\2758\032\"\275\366tH;/\272S\275\263v\031=O\272\253\273\254#3\275\366{\226\273\345?\310\274\\\304\244<\247kw=\235\034\346<\3103\201<\231c\262\275\205pQ=\260Y\210\2732\027\022\273\234\367\331\273\005o\224\275\354\275\271\275\275\240\010\276}O\033\276\302.c\275\260\264\021\275\177\247\240<\327\020\322\275\027\277\355\274\353\274\357\275(b\317\274{r?=\342\010\223\275 \204\203\275\222\236k\275W\275\234\275\265\367\351\275\213\266\225\274_M\311\274\365\321\256=\275\261\263\2750\331\033\276G\314\022\276>\350\350\275Wr|\275\226w\323\271\234\345\000=\017|\226<=\274\341<\357\320\014=\177I\240\274o\030\251=\272\377\002=9\370\347<<\373\035\276\324\240L\276\201\225\003\276fM\227\275E:\270=E\013\215<\277\001\355<i+\025\275\252q~;\245\331\021\275_\336\001\275\205<\206=U\261\023>\032\373\223<\2007Z\275{\262\006\275\024\256\026=$\237\342\2744.\200<\001t\215;\025\324|=e\242^=w\201[\275\244G\316\274\032M\353=\267\031\002=p\317\007\275\001\022@\275|l\234=\247N\350=%X\346=\375\025B=T\006\013;\307\326\366\2738Pd=\241\003\216\275\210\261-=\003\364\'\275\302\0338<\2020O=aC\233\275B\250\325\274\334\026\207=\353\n\336=\244\217\324=\240\303\026\275\331Bz=q\352\370\274n\362K;\3225F\275h\272.\272\367|\325\275\000\203\274\2752\212\237\275P\034Z<\344\017C;q\360\214\275\026w\257\273\216iv=\315e\225\275\315`h=SQH=\334\337H\273\021b1\275\207\350\271<\005\270\244<\000k0\275\351`{\275P\337\217\275|\3537\275\266\306\267\272\355\231\210<\343\2736\274&/_=\240*]<*\205d<\0003\201\275f\263F\275\354\250\243<D\036\377;\"\"\027\275\n\323\236\275\331G\307\275\363<\307\274v\366\227\2750a\037\275\260\n$\275o\323\302\275\347:\262<z\204\'\275W\252\310\275\033%\277\275\n\260\255\275K\310x\275\311\226)\275\333\007\211\274\202\366\203\275\304\323\374\275\376w\326\275\\\266i\275r<:=D\256\361\274\233\020\305\275\n\346k\275QW\243\275;\205\216\274\303\327\007\2752XG\275e\035 <7Dh\275M\311\260;C\375\213<\2738A=\331\247\242\274q\024\213<$\347\335=\242\032\354\2744Sq\275\274\352\027\275\320\025\254\275\357\001\222\2756_|\275\"\252\306\275\014\302\345\275\004\034\370\275\224N\213\276\352FD\276[\311\316\275\346m\212=\216\356&>\325\371L<z*t\275\2238*=\271Q\221<pI\375\273\227|\303\275\005\267\304\275\237\374\273\275w\332\274\275\234\001\210\275E\334\270\275\334\215\254;%y5\275\271Pn=\016\365Q<yYV=\270\265\244\275\360u\311\275\273B\317\275D.\203\275\255\n^\275\240\3110\275\277\205\301<;a\210\275^q\272\275\313\254\006\276\316V\002\276\272\233\340\275\022\001\225<w\014\243<\200\030*\275\013\035\351\274Z\251\227\274\020\343$=:P\254\2738\253r=)\326\200=\264\007\242=\236\025V<\004\241\t\276\203w\363\275l\214\351\275\006_I\275&\204\266\275a\267\004\275\337\260^\275\001~\037\275\326\026 >\311f\263=j!\020>Z\311\312=C9\273=\323\\\001;\322\036\231<?\310\236=\242\314\271<k\004\025\275R\345\367<\376l\013\275\230\351\233\275O\306>=}\256\314=G\375\257=X\023\'=\312M)>\022\'\245=\024\263\203<\361\300b=\360jg\272\206k\014=\304<I\275\220\340\014\275/\031\231;D,\344\274\363\207H\275^\261\035\275iz\205\274e\003\205\275J\336\341=\026\322\352<J\352q\275\036\312,\274\277\177\342\274|\177\276\272\203cJ\274\013`\262\274\014\023\212\274\242K\242<\326o\343\275\006\025\271\275$\226\216\274m\365\264\275\326dT<\026\333/=\335\202K=|\317\353\274\035\214\243\275}\200\r\275}\337\204\275\000y\r;\343\250\352\273\314|\206\274\212\335\014=n\024\002\276=\005\303\275\276\207\262\274\344 \347\275\331\211\224\275i\336\302<\330\204\270=l]\215\274B\367\326\273\324\253m<^\241D\275\376b\032<\214\346\317\273\255/\240\275\274kJ\275~\300#\274\021\222O\275h\224\323\274A\241\n\274\351\204\271\275|\241q\275]\327I<a\256>\275Z\363\223\275\211\217\224\274\3669\261\275\260f\025\275@\352\014\275-\245\341\275&k\373\275\213K\023\276\322\014\035\276P\266`\275\3016\247\275\0373\t\276\n\211\236\275(\237\271<{\025\016=\263^\251\274\357>\006\273c\002k\275\223\r!=\267\346\274\274\'\214|;<\337\202\274\314\033\305<e\221\200<\331\301\233\274\314f^\274TNG\273g\320s\275\256>\355\273aWg\275\3635V=ss\010=\322\3744\274\021Q5=\210=\2659wms=|~\220<\373\244\177=V\234\202=\303\305\201<\331\035\017\275\323\366\306\274}\270T=C\351\t=\265\302\327\274\022\017E\275\301\021g=zB\"\275\236\242\007\2761\364\245\275@\301\231\275\315\003\242\275\326\337R\275\246#\'=\356\362]\274!\023+=\305\0133\275\177\236f=%\363[=\376\364z=f6\331\275\316\364\000\276\373\024\235\275\344\236>\275LO\337=W\000\010>R^\027>\244\023\341=\270^\277\272\343\\\252\273\370\203\206\274z\336U={\227q=i\177\r\275\315\276\315\275\253\270d\275\256\342\241\275\336\242\022>zRQ>\345\016\032>\305\0218\275x;G\275P\3713\274w\340>\275\025M\274\274\346+K<\005UW=-\3669=\343\n\321\275\371\204\037=\026\345\001\275v\360m=<\016\256\273\032\225\002\276pdH\276q:\037\276!\030C\276\276>\001\276\252\205Z<Jo2\273\326\375%\275:\017Z=\274\355\221\275\n\212\317\274\372;Y=(\303P\272\005]\236\275cH?\275~\354\233\275\010\310\"\275W<\264\275\323r`\275\327\273\177\274k-\360\274p\254*=\345B\231\275\3745-\275F{\241\274X\366\035=\235\214\022\275\344c\332;y\"\361<u\211\255<}\333\270=\275\303\005\276\0343J\275KD\346\275\265\177\320<&f\204\275\031\235\373\274\256\320y\275\312\034\236\275\232kV<(\032}\274*\375\367\275\177f\000\275\321[E=\372\3015=X\266\202\275\024=t\275)\206\252\274\277\243\264\274\361\023\017;q\026\244\273\262bO=\237+\254\275V\353\226\275\303P\254\275\257\270A\275\177\243!\275;k\027=E\312\205<VF\375\274\246&\346\275\244\305U\274L(F=\316\275*=/\251}\275\005Y\010\2748\374<=\226\204|<\232\303h<\032\245\212=\036\370\207=\345\035\270=\027\231\211=\262\270\245<AR\307\274\310\003\316<\264\206<=4\265s\275\301\177I<%j#\275\324L^\274\3667\r\275\207\235\207\274N\006\234\274\366\374\247\275\371\305\323\275\306\263\240\274\342\026&\275G\365l=#B\023\275Vyh=n\261\'\272\352\230;\275K\0146\273W\360K\274\372Jy<\265\024\"<\237\211\202\275\010h\235<H\336*=1\315l\274\253\003\265<\251\'O=\036\025j\275]\216L=\311\255\200\275Y\241\307\274!#\302<b\331\007\274R\272]\275-\325E\2740\261O=C\264\377<\262\352\036=Q\223\242=\340(\272\274\255v\221;IQ\204\275{\257\t\275\2141A=L~\235<\306\374@\274JX(\275k\017\211\275g\342\253<V\037I\275dol\274p\307`\2756]\026\275\2728\022\274\312\035\267\274\207\247\177\274\232\261\306\274\236\373\215<\274\2764;\213\177Y=Zqk\274)\203\305\275\342\206a\275\216\374x\274\212O\302\275\033\366\216\275\323\010 \275W\202\217\275\221\'R=\221\340\365\274tr\202\275\'\332z\275\3657X\275\337U\243\275Q:\265<\013\270\354;!b\331\275\316\356\253\275ulN\275\006\003\344\2752\324\'=j\365 \274p\303$\273\263\263q\275\025\376\003\275\201\217\032=\307\010\250\2745\324\252\275\330-N\2741j\234\275d\321\354:\366\235\220=i)\017= k\252=\"<\207<q\355\243<\367\262\254\274\310IV=\237\200\242\274\322\201\207<\217*\\\275\003\332\273\274)\3048=\324\226a<\314\036\276=2\217-\274\312\207\017=\335,\262<n`\237\274\362\275z\273\203,X<\000Y\312\275m\324\017=grL\275s\"V\274\274\363\215\273\243\\?\274\023,\245=_\230\260=\235\204F=\320\031\370=YST=6`i=\361\372\205==\3204=\022:\250\275\316\204\244<\343\315\372\274s@\"<8#\235=\355\022\013>\227\300)>z\217\312<V\320\032\275\3573\213=2\213\361=\207\250~=\217\254\214=T\307@\2759\251~\275\270\3740\274\242\323C=j\035g\275\330\312#=\273\'T=\377o\034\275m\275t\275\030\037\206=\020\325\">\256\273\255=\215n\257<\372So;\216\302N<\321:\265\275\2767!;\346(\371<\265\354\334<_l\222\275V\003\006=P\313 \275\276\235\246\274\246\247\372=\177\217\215=\033\310m=\252p\271<3\373;\275;\016\253\275\240\215a\275$\265\207\275\262\216\245\275T\224\r<\342\000\274\275\177/m\275\317\336\244\275\341\311\021\275m\320!\274\030.\270\273W*\026\276\213\302\025\276\242&y\274`\213\003\276\245\023\326\275_0\016\275\342P\207\274T\3213\275\277Y\371\2758\275A\275<\206\022\276BYW\276\254\227K\275d\002\206\275\256\275\276\275\217l\002\276^t\017\276\340\242D\275\025\307\306\275\244\305\017=\335\"\232\275\257\200\355\274\321]\212\275\th+\275\210\003t\275\237\032j\275$V\001\273\346p\316<\317\254\347\274\347\352\253<\326\227|\275\0211\321\274F\275\270<\2052a=\362fM=\330\250\241\275\003jQ\275\226\225\032=z\372\002=\177\333z=+0\341<,